In [42]:
#PANDAS Library
import pandas as pd 
df = pd.read_csv("salaries.csv")

In [33]:
# Creating a Series
s = pd.Series([111,222,3,44,5555], index=['a','b','c','d','e'])

print("Pandas Series:")
print(s)
print("\nAccess single value:", s['e'])

Pandas Series:
a     111
b     222
c       3
d      44
e    5555
dtype: int64

Access single value: 5555

In [46]:
print("Multiped By 2:",s * 2)

Multiped By 2: a      222
b      444
c        6
d       88
e    11110
dtype: int64

In [34]:
type(s)

pandas.core.series.Series

In [40]:
# Creating a DataFrame
data = {
    'Name': ['Yash', 'Ranjan', 'Nick','Saurabh','Ritesh'],
    'Age': [21, 20, 24,19,18],
    'Marks': [99, 90, 79,88,89],
    'Location':['Mumbai','Delhi','Jalna','Pune','Nagpur'],
}

df1 = pd.DataFrame(data)

print("Pandas DataFrame:")
print(df)
print("\nAccess single column (as Series):")
print(df['Location'])

Pandas DataFrame:
      Name  Age  Marks Location
0     Yash   21     99   Mumbai
1   Ranjan   20     90    Delhi
2     Nick   24     79    Jalna
3  Saurabh   19     88     Pune
4   Ritesh   18     89   Nagpur

Access single column (as Series):
0    Mumbai
1     Delhi
2     Jalna
3      Pune
4    Nagpur
Name: Location, dtype: object

In [44]:
type(df1) # DataFrame type

pandas.core.frame.DataFrame

In [ ]:
df1.info() # Informtion about DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      int64
 2   Marks     5 non-null      int64
 3   Location  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [ ]:
df.shape # Shape of DataFrame

(148521, 11)

In [8]:
df.head()        # first 5 rows

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,SE,FT,Software Engineer,218900,USD,218900,US,100,US,M
1,2025,SE,FT,Software Engineer,186065,USD,186065,US,100,US,M
2,2025,SE,FT,System Engineer,158000,USD,158000,US,0,US,M
3,2025,SE,FT,System Engineer,140000,USD,140000,US,0,US,M
4,2025,SE,FT,Data Engineer,164600,USD,164600,US,0,US,M

In [9]:
df.tail()        # last 5 rows

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
148516,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
148517,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
148518,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
148519,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
148520,2021,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

In [ ]:
df.shape         # (rows, columns)

(148521, 11)

In [11]:
df.info()        # summary (data types, non-null count)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148521 entries, 0 to 148520
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           148521 non-null  int64
 1   experience_level    148521 non-null  object
 2   employment_type     148521 non-null  object
 3   job_title           148521 non-null  object
 4   salary              148521 non-null  int64
 5   salary_currency     148521 non-null  object
 6   salary_in_usd       148521 non-null  int64
 7   employee_residence  148521 non-null  object
 8   remote_ratio        148521 non-null  int64
 9   company_location    148521 non-null  object
 10  company_size        148521 non-null  object
dtypes: int64(4), object(7)
memory usage: 12.5+ MB

In [12]:
df.dtypes        # data types of each column

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [13]:
df.describe()    # summary statistics (mean, std, min, max, etc.)

           work_year        salary  salary_in_usd   remote_ratio
count  148521.000000  1.485210e+05  148521.000000  148521.000000
mean     2024.424196  1.628834e+05  157518.521125      20.881895
std         0.673689  2.092713e+05   74167.537288      40.578639
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060000e+05  105943.000000       0.000000
50%      2025.000000  1.470000e+05  146100.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [14]:
df.columns       # list of column names

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [15]:
df.index         # row index

RangeIndex(start=0, stop=148521, step=1)

In [16]:
df['job_title']             # select single column

0                Software Engineer
1                Software Engineer
2                  System Engineer
3                  System Engineer
4                    Data Engineer
                    ...
148516              Data Scientist
148517    Principal Data Scientist
148518              Data Scientist
148519       Business Data Analyst
148520              Data Scientist
Name: job_title, Length: 148521, dtype: object

In [19]:
df[['job_title','salary','work_year']]   # select multiple columns

                       job_title   salary  work_year
0              Software Engineer   218900       2025
1              Software Engineer   186065       2025
2                System Engineer   158000       2025
3                System Engineer   140000       2025
4                  Data Engineer   164600       2025
...                          ...      ...        ...
148516            Data Scientist   412000       2020
148517  Principal Data Scientist   151000       2021
148518            Data Scientist   105000       2020
148519     Business Data Analyst   100000       2020
148520            Data Scientist  7000000       2021

[148521 rows x 3 columns]

In [20]:
df.iloc[0]             # first row by index

work_year                          2025
experience_level                     SE
employment_type                      FT
job_title             Software Engineer
salary                           218900
salary_currency                     USD
salary_in_usd                    218900
employee_residence                   US
remote_ratio                        100
company_location                     US
company_size                          M
Name: 0, dtype: object

In [21]:
df.iloc[1:10]           # rows by index range

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1,2025,SE,FT,Software Engineer,186065,USD,186065,US,100,US,M
2,2025,SE,FT,System Engineer,158000,USD,158000,US,0,US,M
3,2025,SE,FT,System Engineer,140000,USD,140000,US,0,US,M
4,2025,SE,FT,Data Engineer,164600,USD,164600,US,0,US,M
5,2025,SE,FT,Data Engineer,144200,USD,144200,US,0,US,M
6,2025,MI,FT,Manager,184200,USD,184200,US,0,US,M
7,2025,MI,FT,Manager,112800,USD,112800,US,0,US,M
8,2025,SE,FT,Research Scientist,200200,USD,200200,US,0,US,M
9,2025,SE,FT,Research Scientist,184695,USD,184695,US,0,US,M

In [24]:
df.loc[df['salary']>100000] # filter condition by condition

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,SE,FT,Software Engineer,218900,USD,218900,US,100,US,M
1,2025,SE,FT,Software Engineer,186065,USD,186065,US,100,US,M
2,2025,SE,FT,System Engineer,158000,USD,158000,US,0,US,M
3,2025,SE,FT,System Engineer,140000,USD,140000,US,0,US,M
4,2025,SE,FT,Data Engineer,164600,USD,164600,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
148515,2021,SE,FT,Data Specialist,165000,USD,165000,US,100,US,L
148516,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
148517,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
148518,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
148520,2021,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

In [25]:
df.describe()          # summary statistics (mean, std, min, max, etc.)
df['salary'].mean()     # average marks

np.float64(162883.41518034486)

In [26]:
df['salary'].median()   # median

np.float64(147000.0)

In [27]:
df['salary'].max()      # maximum value

np.int64(30400000)

In [28]:
df['salary'].min()      # minimum value

np.int64(14000)

In [29]:
df['salary'].sum()      # sum of column

np.int64(24191607706)

In [30]:
df['salary'].value_counts()  # frequency count

salary
160000     2637
150000     2551
110000     2536
100000     2041
180000     2031
           ...
111775        1
4900000       1
1799997       1
21844         1
81096         1
Name: count, Length: 12142, dtype: int64